backend/load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Warm-up (low load)"
    - duration: 30
      arrivalRate: 15
      name: "Main load test (15 users/sec)"

scenarios:
  - name: "Protected Films endpoint with real JWT"
    flow:
      - get:
          url: "/films"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MSwiZW1haWwiOiJ0ZXN0Nzg5Njg1Nzg0Nzg5NkBleGFtcGxlLmNvbSIsImlhdCI6MTc3ODc0Mjk5NiwiZXhwIjoxNzc4NzQ2NTk2fQ.GumJhD7KX-SvoaqiNOctgGwcMO58lWZRNaCVl8NGgJc"
          qs:
            page: 1
            limit: 10